In [1]:
import pandas as pd
import numpy as np
from sklearn.neighbors import NearestNeighbors
from scipy.sparse import csr_matrix

In [23]:
books = pd.read_csv('../data/Books.csv',  encoding='latin-1', on_bad_lines='skip')
users = pd.read_csv('../data/Users.csv',  encoding='latin-1', on_bad_lines='skip')
ratings = pd.read_csv('../data/Ratings.csv',  encoding='latin-1', on_bad_lines='skip')
ratings.columns = ratings.columns.str.strip()
books.columns = books.columns.str.strip()

C:\Users\ali\AppData\Local\Temp\ipykernel_11616\3894335283.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books = pd.read_csv('../data/Books.csv',  encoding='latin-1', on_bad_lines='skip')

In [5]:
books.info()
users.info()
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249936 entries, 0 to 249935
Data columns (total 1 columns):
 #   Column                                                                                         Non-Null Count   Dtype
---  ------                                                                                         --------------   -----
 0   ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L  249936 non-null  object
dtypes: object(1)
memory usage: 1.9+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278698 entries, 0 to 278697
Data columns (total 1 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   User-ID,Location,Age  278698 non-null  object
dtypes: object(1)
memory usage: 2.1+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149780 entries, 0 to 1149779
Data columns (total 1 columns):
 #   Column                    Non-Null Count    Dtype
---  ------                    --------------    -----
 0   User-ID,ISBN,Book-Rating  1149780 non-null  object
dtypes: object(1)
memory usage: 8.8+ MB

In [7]:
books.describe()

       ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
count                                              249936
unique                                             249936
top     0195153448,Classical Mythology,Mark P. O. Morf...
freq                                                    1

In [8]:
users.describe()

           User-ID,Location,Age
count                    278698
unique                   278698
top     1,"nyc, new york, usa",
freq                          1

In [9]:
ratings.describe()

       User-ID,ISBN,Book-Rating
count                   1149780
unique                  1149780
top         276725,034545104X,0
freq                          1

In [21]:
##saving only meaningful rating
ratings = ratings[ratings['Book-Rating'] >0]
print(ratings.columns.tolist())

['User-ID', 'ISBN', 'Book-Rating']